# Before you start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [624]:
!pip install -U scipy

Requirement already satisfied: scipy in /Users/steib/opt/anaconda3/lib/python3.9/site-packages (1.9.0)
Requirement already satisfied: numpy<1.25.0,>=1.18.5 in /Users/steib/opt/anaconda3/lib/python3.9/site-packages (from scipy) (1.20.3)

In [625]:
# import numpy and pandas
import pandas as pd
import numpy as np

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the San Francisco. We will start by loading the dataset and examining its contents.

In [626]:
salary = pd.read_csv('../data/Salaries.csv')

/Users/steib/opt/anaconda3/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

Examine the `salaries` dataset using the `head` function below.

In [627]:
salary.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

We see from looking at the `head` function that there is quite a bit of missing data. Get the amount of missing data in every column

In [628]:
salary.isna().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

Get the shape of the dataframe

In [629]:
salary.shape

(148654, 13)

Given output of the previous two cells, drop the corresponding column and compute again the amount of missing values.

In [630]:
salary.drop('Notes', axis = 1, inplace = True)

In [631]:
salary.isna().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Agency                   0
Status              110535
dtype: int64

Check out what are the possible values of the column "Status".

In [632]:
salary['Status'].unique()

array([nan, 'PT', 'FT'], dtype=object)

Drop any row with missing values in the "Status" column and compute again the number of missing values.

In [633]:
salary = salary[~salary['Status'].isnull()]

In [634]:
salary.isna().sum()

Id                  0
EmployeeName        0
JobTitle            0
BasePay             0
OvertimePay         0
OtherPay            0
Benefits            0
TotalPay            0
TotalPayBenefits    0
Year                0
Agency              0
Status              0
dtype: int64

Check out the types of each column and see if they make sense.

In [635]:
salary.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 38119 entries, 110531 to 148653
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id                38119 non-null  int64
 1   EmployeeName      38119 non-null  object
 2   JobTitle          38119 non-null  object
 3   BasePay           38119 non-null  object
 4   OvertimePay       38119 non-null  object
 5   OtherPay          38119 non-null  object
 6   Benefits          38119 non-null  object
 7   TotalPay          38119 non-null  float64
 8   TotalPayBenefits  38119 non-null  float64
 9   Year              38119 non-null  int64
 10  Agency            38119 non-null  object
 11  Status            38119 non-null  object
dtypes: float64(2), int64(2), object(8)
memory usage: 3.8+ MB

In [636]:
salary.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Status
110531,110532,David Shinn,Deputy Chief 3,129150.01,0.0,342802.63,38780.04,471952.64,510732.68,2014,San Francisco,PT
110532,110533,Amy P Hart,Asst Med Examiner,318835.49,10712.95,60563.54,89540.23,390111.98,479652.21,2014,San Francisco,FT
110533,110534,William J Coaker Jr.,Chief Investment Officer,257340.0,0.0,82313.7,96570.66,339653.70,436224.36,2014,San Francisco,PT
110534,110535,Gregory P Suhr,Chief of Police,307450.04,0.0,19266.72,91302.46,326716.76,418019.22,2014,San Francisco,FT
110535,110536,Joanne M Hayes-White,"Chief, Fire Department",302068.0,0.0,24165.44,91201.66,326233.44,417435.10,2014,San Francisco,FT

Do any type conversions and reset the index.

In [637]:
salary['BasePay'] = pd.to_numeric(salary['BasePay'])
salary['OvertimePay']= pd.to_numeric(salary['OvertimePay'])
salary['OtherPay'] = pd.to_numeric(salary['OtherPay'])
salary['Benefits'] = pd.to_numeric(salary['Benefits'])

In [638]:
salary.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 38119 entries, 110531 to 148653
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id                38119 non-null  int64
 1   EmployeeName      38119 non-null  object
 2   JobTitle          38119 non-null  object
 3   BasePay           38119 non-null  float64
 4   OvertimePay       38119 non-null  float64
 5   OtherPay          38119 non-null  float64
 6   Benefits          38119 non-null  float64
 7   TotalPay          38119 non-null  float64
 8   TotalPayBenefits  38119 non-null  float64
 9   Year              38119 non-null  int64
 10  Agency            38119 non-null  object
 11  Status            38119 non-null  object
dtypes: float64(6), int64(2), object(4)
memory usage: 3.8+ MB

Check out if "TotalPayBenefits" = "BasePay" + "OvertimePay" + "OtherPay" + "Benefits"

In [724]:
# Check if assumption is True
sum_benefits = salary['TotalPayBenefits'] == salary['BasePay']+salary[ "OvertimePay"]+salary['OtherPay']+salary['Benefits']

# Compute % of False 
false_perc = round(sum_benefits.value_counts()[0] / len(sum_benefits) * 100, 2)

print('The percentage of wrong assumptions is {}'.format(false_perc))

The percentage of wrong assumptions is 26.29

There are different departments in the city. List all departments and the count of employees in each department.

In [642]:
pd.pivot_table(salary, index='JobTitle', values = 'EmployeeName', aggfunc='count')

                                EmployeeName
JobTitle
ACPO,JuvP, Juv Prob (SFERS)                1
ASR Senior Office Specialist              22
ASR-Office Assistant                      15
Account Clerk                             93
Accountant I                               2
...                                      ...
Wire Rope Cable Maint Sprv                 1
Worker's Comp Supervisor 1                 6
Worker's Compensation Adjuster            26
X-Ray Laboratory Aide                     35
Youth Comm Advisor                         1

[996 rows x 1 columns]

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of **all FT workers is significantly different from $75/hr**. Get first the hourly wage by dividing "TotalPayBenefits" by 50 weeks (assuming 10 labour days of holidays) and by 40hrs (assuming a 40hrs week).

$$Hourly Wage = \frac{TotalPayBenefits}{1 year}\frac{1 year}{50 Week}\frac{1 Week}{40 hr}$$

Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [643]:
salary['Hourly_Wage'] = (salary['TotalPayBenefits'] / 50) / 40
salary.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Status,Hourly_Wage
110531,110532,David Shinn,Deputy Chief 3,129150.01,0.00,342802.63,38780.04,471952.64,510732.68,2014,San Francisco,PT,255.366340
110532,110533,Amy P Hart,Asst Med Examiner,318835.49,10712.95,60563.54,89540.23,390111.98,479652.21,2014,San Francisco,FT,239.826105
110533,110534,William J Coaker Jr.,Chief Investment Officer,257340.00,0.00,82313.70,96570.66,339653.70,436224.36,2014,San Francisco,PT,218.112180
110534,110535,Gregory P Suhr,Chief of Police,307450.04,0.00,19266.72,91302.46,326716.76,418019.22,2014,San Francisco,FT,209.009610
110535,110536,Joanne M Hayes-White,"Chief, Fire Department",302068.00,0.00,24165.44,91201.66,326233.44,417435.10,2014,San Francisco,FT,208.717550

## FT EMPLOYEES

In [644]:
from scipy import stats
import math

-  H0: There is no difference between the the average wage and 75/h | x = 75/h
-  H1: There is a difference | x != 75/h
-  Alpha will be set at 0.05

In [645]:
# Computing the AVG Hourly Wage for FT Employees
hourly_wage_FT = round(pd.pivot_table(salary, index = 'Status', values = 'Hourly_Wage')['Hourly_Wage'][0],2)

# Determining the Sample for the next steps
sample = salary.loc[salary['Status'] == 'FT', 'Hourly_Wage'] 

# Coputing the standard deviation of the sample
sample_sd = np.std(sample)

In [646]:
# Computing the t - statistic for the sample mean

t_score = (hourly_wage_FT - 75)/(sample_sd / (math.sqrt(len(sample))))
print(t_score)

-35.8333805973806

In [647]:
# Method 1: Critical value. Get the critical value and compare it against your statisttic.

upper_critical_value = stats.t.ppf(q=1-0.05/2, df=len(sample)-1)
lower_critical_value = stats.t.ppf(q=0.05/2, df=len(sample)-1)

print('The critical value is +- {}'.format(upper_critical_value))
print()
print('The t score is {}'.format(t_score))
print()
print('T Score < {} --> we reject the H0!'.format(round(lower_critical_value, 2)))

The critical value is +- 1.9600702128845593

The t score is -35.8333805973806

T Score < -1.96 --> we reject the H0!

In [648]:
# Method 2: Use the p-value method.

p_value = (1-(stats.t.cdf(t_score, df = len(sample)-1)))*2

print('the p_value {} is smaller than the significance level 0.05! ---> we reject H0!'.format(p_value))

the p_value 2.0 is smaller than the significance level 0.05! ---> we reject H0!

In [649]:
# Method 3: Use the ttest_1samp function from scipy. 

t_stat, p_value = stats.ttest_1samp(sample, 75)

print('T_stats are:  {}'.format(t_stat))
print()
print ('p_value is {}'.format(p_value))
print()
print('p_value < 0.05 ---> We reject H0!')
print()

T_stats are:  -35.80631941460526

p_value is 4.517831233839447e-273

p_value < 0.05 ---> We reject H0!

#### --> there is a **significant difference** between the two means

- all methods confirmed this

## POLICE

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are **higher than last year's mean of $86000/year for all salaried employees** (use the column "TotalPayBenefits". Test  hypothesis using a 95% confidence interval.

Hint: Use apply and a lambda function to check in "Police" is in the "JobTitle" to get all the "Police" jobs.

In [650]:
# Filter the Police:
police = salary[salary['JobTitle'].str.contains('Police')]

# Compute all values needed for the TEST:
sample = police['TotalPayBenefits']
mean_salary = np.mean(police['TotalPayBenefits'])
sdt_salary = np.std(police['TotalPayBenefits'])
df = len(police)-1
pop_mean = 86000

#Compute the T SCORE
t_score = (mean_salary - pop_mean) / (sdt_salary / (math.sqrt(len(police))))
t_score

50.266207472174855

In [651]:
# Method 1: Critical value. Get the critical value and compare it against your statisttic.
critical_value = stats.t.ppf(q = 1-0.05, df = df)

print('t_score = {}'.format(round(t_score, 2)))
print('critical value = {}'.format(round(critical_value, 2)))
print()
print('t_score > critical value ----> we reject H0 ---> The salary increased!')

t_score = 50.27
critical value = 1.65

t_score > critical value ----> we reject H0 ---> The salary increased!

In [652]:
# Method 2: Use the p-value method.

p_value = 1 - (stats.t.cdf(t_score, df = len(police)-1))

print('The P Value = {}. --> it is smaller than 0.05 --> we reject the HO --> Salaries have increased!'. format(p_value))

The P Value = 0.0. --> it is smaller than 0.05 --> we reject the HO --> Salaries have increased!

In [653]:
# Method 3: Use the ttest_1samp function from scipy.

In [654]:
t_stat, p_value = stats.ttest_1samp(sample, pop_mean)

print('The T Score =  {}'.format(t_stat))
print ('The P Value = {}'.format(p_value))
print()
print('p_value < 0.05 ---> We reject H0! --> Salary did increase!')
print()

The T Score =  50.252984742109945
The P Value = 0.0

p_value < 0.05 ---> We reject H0! --> Salary did increase!

## MOST EMPLOYEES

The workers from the "JobTitle" with the most employees have complained that their hourly wage is **less than $35/hour**. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [655]:
#Definging H0, H1:
print('DEFINING THE TEST:')
print()
print('Left Tailed One Sample T-test')
print('Null Hypothesis: The mean wage is 35/h ')
print('Alternative Hyp: The mean wage is less than 35/h')
print('Sig. Value = 0.05')
print()
print('TEST PARAMETERS')
print()


#Get the department which has most employees

df_pivot= pd.pivot_table(salary, index = 'JobTitle', values = 'EmployeeName', aggfunc = 'count') 
df = df_pivot.reindex(df_pivot['EmployeeName'].sort_values(ascending=False).index) # Reorder the Pivot Table to get the highest value first 
job = df.index[0]
print('The Department with the most Employees = {}'.format(job))

# Compute neccesary parameters for the tests:

len_job = df.iloc[0, 0] # Here i filter the previous pivot table for the number of Employees
degree_of_freedom = len_job - 1

print('The Degrees of Freedom for this sample = {}'.format(degree_of_freedom))

#Computing mean for sample (with HOURLY WAGE)

df_mean = pd.pivot_table(salary, index = 'JobTitle', values = 'Hourly_Wage') # Here i use the pivote table and a filter to get the value
sample_mean = df_mean[df_mean.index == job]['Hourly_Wage'][0]
pop_mean = 35
print('The Sample Mean = {} and the Population Mean = {}'.format(round(sample_mean,2), pop_mean))

#Compute the Standard Deviation for the Sample

sample_std =  np.std(salary.loc[salary['JobTitle'] == job, 'Hourly_Wage']) # Filter the salary table by Transit Operator, return Hourly Wage and compute the std. 
print('The Standard Dev of the Sample = {}'.format(round(sample_std, 2)))

# Sample:
sample = salary.loc[salary['JobTitle'] == job, 'Hourly_Wage']

DEFINING THE TEST:

Left Tailed One Sample T-test
Null Hypothesis: The mean wage is 35/h
Alternative Hyp: The mean wage is less than 35/h
Sig. Value = 0.05

TEST PARAMETERS

The Department with the most Employees = Transit Operator
The Degrees of Freedom for this sample = 2478
The Sample Mean = 43.36 and the Population Mean = 35
The Standard Dev of the Sample = 21.83

In [656]:
# Computing the t - statistic: 

t_statistic = (sample_mean - pop_mean) / (sample_std / (math.sqrt(len_job)))
print('The t-statistic for the sample mean = {:.2f}'.format(t_statistic))

The t-statistic for the sample mean = 19.07

In [657]:
# Method 1: Critical value. Get the critical value and compare it against your statisttic.

t_critical = stats.t.ppf(q = 0.05, df = degree_of_freedom)
print('The crictical value  = {:.2f}'.format(t_critical))

# Conclusion: 

print()
print('The t_statistic is bigger than the critical value ---> We accept the H0 --> the wage is not smaller!')

The crictical value  = -1.65

The t_statistic is bigger than the critical value ---> We accept the H0 --> the wage is not smaller!

In [658]:
# Method 2: Use the p-value method.
# Your code here:

p_value = stats.t.cdf(t_statistic, df = degree_of_freedom)
print('The P-Value  = {}'.format(p_value))

# Conclusion: 

print('The p_value is bigger than any of the common crictical p-values ----> we accept the H0!')

The P-Value  = 1.0
The p_value is bigger than any of the common crictical p-values ----> we accept the H0!

In [659]:
### -- > is the p_value really 1 or is this rounded?

In [660]:
# Method 3: Use the ttest_1samp function from scipy. 

t_stat, p_value = stats.ttest_1samp(sample, pop_mean)
print('The S_stat = {:.2f}'.format(t_stat))
print('The p_valu = {:.2f}'.format(p_value))

The S_stat = 19.06
The p_valu = 0.00

In [661]:
### ---> not sure why my p-value here is 0! Should not be the case

# Challenge 3: To practice - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level.

In [662]:
# Method 1: Get the critical values which correspond to a 95% confidence.

sample = salary['Hourly_Wage']

# Calculate the parameters: 

x_bar = np.mean(sample)
std = np.std(sample)
n = len(sample)
df = n-1
alpha = 1-0.95

print(x_bar, std, n, df, alpha)

50.130719334189436 33.11674882138177 38119 38118 0.050000000000000044

In [663]:
# Computing the t - values

critical_t = stats.t.ppf(1-alpha/2, df)
margin_error = critical_t * (std / math.sqrt(n))

Now compute a 95% confidence interval for the hourly salary of all the Police employees.

In [664]:
# Compute the CI:

upper_bound = x_bar + margin_error
lower_bound = x_bar - margin_error

In [698]:
print()
print("Critical t-value: {:.3f}".format(critical_t))
print("Margin of Error: {:.3f}".format(margin_error))
print("Confidence Interval of 95%: [{:.2f},{:.2f}]".format(lower_bound,upper_bound))
print()
print('With 95% certainty the estimated population lies between 49.8 and 50.46')

Critical t-value: 1.960
Margin of Error: 0.332
Confidence Interval of 95%: [49.80,50.46]

With 95% certainty the estimated population lies between 49.8 and 50.46

# Chi2 test

Now we want to know if the amount of full time "FT" and part time "PT" employees is equal between Lawers, Meds, Police, Firemen and other departments. 

Considering all the options in this groups of employees will be very time consuming. To simplify this process, create first a function that returns:

* "Policemen" if "Police" is found on "JobTitle"
* "Firemen" if "Fire" is found on "JobTitle"
* "Medical" if "Med" or "Nurse" is found on "JobTitle"
* "Lawyer" if "Attorney" is found on "JobTitle"
* "Other" in any other cases

Then, create a new column named "employee_group" that determines to which group belong the employee.

In [666]:
# Your code here: (Create the function)

employee_group = []

for i in salary['JobTitle']:
    if 'Police' in i:
        employee_group.append('Policemen')        
    elif 'Fire' in i:
        employee_group.append('Firemen') 
    elif 'Med' in i or 'Nurse' in i:
        employee_group.append('Medical')
    elif 'Attorney' in i:
        employee_group.append('Lawyer')
    else: 
        employee_group.append('Other')
        
salary['employee_group'] = employee_group

In [667]:
salary['employee_group'].value_counts()

Other        30371
Medical       3917
Policemen     1901
Firemen       1511
Lawyer         419
Name: employee_group, dtype: int64

In [668]:
# Determine how many "PT" and "FT" employees have all the employees groups.

crosst = pd.crosstab(salary['employee_group'], salary['Status'], margins = True, margins_name = 'Total').reset_index()
crosst

Status employee_group     FT     PT  Total
0             Firemen   1333    178   1511
1              Lawyer    317    102    419
2             Medical   1028   2889   3917
3               Other  18126  12245  30371
4           Policemen   1530    371   1901
5               Total  22334  15785  38119

Now try compute the expected frequencies doing the calculations with the individual probabilities. Remember that the Chi2 test assumes that both variables (employee_group and FT/PT) are not related (therefore they are independent). Therefore, to compute the expected frequencies you need to compute the probability of each cell and multiply it by the number of observations. ie:

$$\nu(x,y) = p(x,y) * N = p(x) * p(y) * N$$

bear in mind that in general: $p(x,y)\neq p(x)*p(y)$; the equality will only be true if x and y are independent. However, the null hypotheses says that **x and y are independent.** but that's what we're assuming with the null hypotheses.

where "x" is the "employee_group" and "y" the (FT/PT).

* Store all the expected frequencies of "FT" employees in a list 
* Store all the "PT" employees into another list
* Create a dictionary with "FT" and "PT" as keys and as the values use the previous lists
* Create a dataframe with this dictionary using pd.DataFrame()

In [669]:
# Define rows and columns for the coming function: 

rows = salary['employee_group'].unique()
columns = salary['Status'].unique()

# Create the frequency lists

FT = []
PT = []

# Compute all the Expected Frequencies

for i in rows:    
    ''' 
    For each EmployeeGroup and each Status compute the 'Total' and devide through 'Grand Total'
    '''    
    for j in columns: 
        E = int(crosst.loc[crosst['employee_group'] == i, 'Total']) * int(crosst.loc[crosst['employee_group'] == 'Total', j]) / int(crosst.loc[crosst['employee_group'] == 'Total', 'Total'])
        
        if j == 'FT': # append the Expected Frequ to the list
            FT.append(E)
        else: 
            PT.append(E)
            
        print('The Expected Frequency for {} and {} = {}'.format(i,j,E)) 

        
# Create the Dictonary:

fequency_dict = {'Group': rows, 'FT': FT, 'PT': PT}

# Turn into DataFrame to store the data:

df_exp = pd.DataFrame.from_dict(fequency_dict)
crosst


print()
print('Those are the Expected Frequencies:')
print()
display(df_exp)
print()
print('Those are the Observed Frequencies:')
print()
display(crosst)

The Expected Frequency for Other and PT = 12576.569033815158
The Expected Frequency for Other and FT = 17794.430966184842
The Expected Frequency for Medical and PT = 1622.021695217608
The Expected Frequency for Medical and FT = 2294.978304782392
The Expected Frequency for Policemen and PT = 787.2002151158215
The Expected Frequency for Policemen and FT = 1113.7997848841785
The Expected Frequency for Firemen and PT = 625.7020121199402
The Expected Frequency for Firemen and FT = 885.2979878800598
The Expected Frequency for Lawyer and PT = 173.5070437314725
The Expected Frequency for Lawyer and FT = 245.4929562685275

Those are the Expected Frequencies:

       Group            FT            PT
0      Other  17794.430966  12576.569034
1    Medical   2294.978305   1622.021695
2  Policemen   1113.799785    787.200215
3    Firemen    885.297988    625.702012
4     Lawyer    245.492956    173.507044

Those are the Observed Frequencies:

Status employee_group     FT     PT  Total
0             Firemen   1333    178   1511
1              Lawyer    317    102    419
2             Medical   1028   2889   3917
3               Other  18126  12245  30371
4           Policemen   1530    371   1901
5               Total  22334  15785  38119

In [674]:
df_obs = crosst[['FT', 'PT']]
df_obs = df_obs.iloc[:-1, :]
df_obs

Status     FT     PT
0        1333    178
1         317    102
2        1028   2889
3       18126  12245
4        1530    371

Now use the "st.chi2_contingency()" from scipy.stats [documentation here](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.chi2_contingency.html) to conduct a Chi2 test to determine if the diferences between employee groups are statistically significant using a 95% confidence level. Hint: fill the function with a dataframe of actual frequencies.

In [693]:
# Using Contingency Function: 

chi2, p, dof, expected = stats.chi2_contingency(df_obs)

print('The Chi2 Value is = {:.3f}'.format(chi2))
print('The P Value is = {:.3f}'.format(p))
print()
print('The P Value is smaller than 0.05 -- > we reject the H0 --> There is a relationship!')

The Chi2 Value is = 2676.642
The P Value is = 0.000

The P Value is smaller than 0.05 -- > we reject the H0 --> There is a relationship!

## -> There seems to be a relationship between Employee Group and Status

Check if your expected frequencies aggree with the ones obtained with the st.chi2_contingency() function

In [688]:

# Turning array into DF: 
contingency_expected = pd.DataFrame(expected, columns = df_obs.columns)

# Adding the employee_groups to the expected frequencies from the CHi2 Test
contingency_expected['Group'] = crosst['employee_group'].iloc[:-1].tolist()

# Sort the table alphabetically: 
contingency_expected = contingency_expected.sort_values('Group', ascending = True)

In [689]:
contingency_expected

Status            FT            PT      Group
0         885.297988    625.702012    Firemen
1         245.492956    173.507044     Lawyer
2        2294.978305   1622.021695    Medical
3       17794.430966  12576.569034      Other
4        1113.799785    787.200215  Policemen

In [691]:
# Sort the manually computed frequencies alphabetically: 
df_exp.sort_values('Group')


## --> and compare frequencies:

       Group            FT            PT
3    Firemen    885.297988    625.702012
4     Lawyer    245.492956    173.507044
1    Medical   2294.978305   1622.021695
0      Other  17794.430966  12576.569034
2  Policemen   1113.799785    787.200215

## --> The manually computed and the Contengency Frequencies are the same!